Migrate from PlantUML to Mermaid.
